const detailState = {
  title: '请记住杨绛先生的这4句话（深度文字）',
  content:
    '人的一生是一场漫长而坎坷的旅程，多去汲取别人人生的经验，我们在路途上就能少走些弯路，受益终生.杨绛先生的这4句话，字字都是珠玑，读懂了它们，就读懂了人生。',
  mainContent:
    '01\n你的问题主要在于读书不多而想得太多\n人为什么要读书？\n许多人也许都曾问过自己这样一个问题？\n“我读过的书，很快就都忘记了，那么读书究竟还有什么用呢？”\n三毛说：\n“读书多了，容颜自然改变，许多时候，自己可能以为许多看过的书籍都成过眼烟云，不复记忆，其实它们仍是潜在气质里、在谈吐上、在胸襟的无涯，当然也可能显露在生活和文字中。”\n你读过的书，最终决定了你是什么样的人。\n杨绛先生从小就爱读书，在一篇《我爱清华图书馆》的文章里，她温情地把读书比作“串门儿”：\n“借书看，只是要求到某某家去‘串门儿’，而站在图书馆书库的书架前任意翻阅，就好比家家户户都可任意出入，这是唯有身经者才知道的乐趣。”\n不读书的人，只过一世；读书的人，却可以体验千百种人生。\n在人生的目标还没有清晰显现之前，与其焦灼、忧虑，不如去读一本好书，静下心来充实自己。\n你要相信，你若盛开，清风自来。\n当你真正准备好的时候，整个世界都会为你让步。\n02\n我立志一生不说违心的话，不做违心的事\n人活一世，所求的不过是一个心安理得，仰不愧天，俯不怍地。\n16岁时，杨绛在当时著名的振华女校读中学。\n有一次，学生会搞运动，要各学校学生上街搞宣传，在街上演讲，呼吁人们参加革命。\n杨绛不愿参加，于是恳求父亲向学校说“家里不赞成”，这样就能避免去做宣传了。\n父亲却一口回绝，他告诉女儿，不肯，就别去，不要拿别人当挡箭牌。\n杨绛还是犹豫：“不行啊，少数得服从多数啊！”\n父亲却严肃地说：“该服从的就服从；你有理，也可以说。去不去由你。......你知道林肯说的一句话吗？Dare to say no！你敢吗？”\n第二天，杨绛到学校后，勇敢地说出了自己的答案：“我不赞成，我不去。”\n从那以后，杨绛从父亲那里学到了人生最珍贵的一课，那就是敢于说“不”的勇气，勇敢做自己的勇气。“文革”时，钱钟书在中国社科院文学所被贴了大字报，杨绛就在下边一角贴了张小报澄清辩诬。被揪出来批斗时，她仍是据理力争：\n“就是不符合事实！就是不符合事实！”\n在一个人人都狂乱不安、黑白颠倒的时代，杨绛却始终坚守心中的准则。\n她始终牢记着父亲的话——多数并不一定对，你有理，你就去说，永远都要有说”不“的勇气。\n  03\n我以为，夫妻间最重要的是朋友关系\n杨绛与钱钟书是许多人眼中的模范夫妻，他们的婚姻更是让人艳羡。\n杨绛与钱钟书都是当时著名的学者，甚至在钱钟书写出《围城》前，杨绛的名字更为人们所耳熟能详。\n她的《弄假成真》、《游戏人间》、《风絮》等戏剧，带给了她无限的荣耀，可就在戏剧创作的巅峰时刻，当她知晓丈夫决定写作《围城》时，便选择退居幕后，辅助钱钟书进行写作，心甘情愿地为他做“灶下婢”。\n钱钟书写作《围城》时，每写完一小节必要把稿子拿给杨绛看一看，悉心听取她的意见。\n在《人·兽·鬼》的手稿中，钱钟书写下这样一段话：\n赠予杨季康，绝无仅有地结合了各不相容的三者：妻子、情人、朋友。\n曾有人向杨绛讨要婚姻和爱情的秘诀，杨绛说:\n“我以为，夫妻间最重要的是朋友关系，即使不能做知心的朋友，也该是能做得伴侣的朋友或互相尊重的伴侣。门当户对及其他，并不重要。”\n从年少相识起，钱钟书与杨绛风雨同舟65载，无论经过多少磨难，他们始终互相扶持，彼此依偎，靠得不单单只是爱情，更是彼此对对方毫无保留的信任、欣赏与奉献。\n  04\n 常言“彩云易散”，乌云也何尝能永远占领天空。\n写下《我们仨》时，钱钟书和女儿钱瑗都已去世，曾经相亲相爱的一家三口，最终就只剩下杨绛一人。\n说不伤心，怎么可能呢？\n在《我们仨》里，杨绛说; \n "钟书逃走了，我也想逃走，但是逃到哪里去呢？我压根儿不能逃，我得留在人间，打扫现场，尽我应尽的责任。"\n可是哪怕再悲伤，她仍旧宽慰着旁人，“这并不是坏事，你往深处想想，让痛苦的担子由我来挑，这难道不是一件好事吗？”\n不是每个人都有这样的勇气，在痛失所爱后，仍旧坚强地活下去。\n 在《将饮茶》里她说：\n“常言‘彩云易散’，乌云也何尝能永远占领天空。乌云蔽天的岁月是不堪回首的，可是停留在我记忆里不易磨灭的，倒是那一道含蕴着光和热的金边。”\n在她的那些如清茶一般韵味隽永的文字里，饱含着的正是对苦难的宽容，对生命的珍视。\n 人生路上，总是一程风雨一程晴，谁的人生又能永远一帆风顺呢？\n我们所能做的，便是始终豁达地面对人生、面对苦难。\n 如同苏轼一般，竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。\n 人之有生也，如太仓之粒，如灼目之电光，如悬崖之朽木，如逝海之微波。知此者如何不悲？如何不乐？\n生命，是一场漫长而又短暂的旅程。我们会走过平原，也会跨过荆棘，会体味甜蜜，也不得不承受悲伤，可我们依旧要勇敢地、不懈地走下去。\n因为生命的美好，就在那悲喜交集里。\n"',
};

const detail = (state = detailState, action) => {
  switch (action.type) {
    default:
      return state;
  }
};

export default detail;
